{
  "hexagrams": [
    {
      "number": 1,
      "binary": "111111",
      "name": {
        "chinese": "乾",
        "pinyin": "qián",
        "english": "The Creative"
      },
      "trigrams": {
        "upper": "111",
        "lower": "111"
      },
      "judgment": {
        "text": "The Creative works sublime success, furthering through perseverance.",
        "chinese": "乾：元，亨，利，貞。"
      },
      "image": {
        "text": "The movement of heaven is full of power. Thus the superior man makes himself strong and untiring.",
        "chinese": "天行健，君子以自強不息。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Hidden dragon. Do not act."
        },
        {
          "position": 2,
          "text": "Dragon appearing in the field. It furthers one to see the great man."
        },
        {
          "position": 3,
          "text": "All day long the superior man is creatively active. At nightfall his mind is beset with cares. Danger. No blame."
        },
        {
          "position": 4,
          "text": "Wavering flight over the depths. No blame."
        },
        {
          "position": 5,
          "text": "Flying dragon in the heavens. It furthers one to see the great man."
        },
        {
          "position": 6,
          "text": "Arrogant dragon will have cause to repent."
        }
      ]
    },
    {
      "number": 2,
      "binary": "000000",
      "name": {
        "chinese": "坤",
        "pinyin": "kūn",
        "english": "The Receptive"
      },
      "trigrams": {
        "upper": "000",
        "lower": "000"
      },
      "judgment": {
        "text": "The Receptive brings about sublime success, furthering through the perseverance of a mare.",
        "chinese": "坤：元，亨，利牝馬之貞。"
      },
      "image": {
        "text": "The earth's condition is receptive devotion. Thus the superior man who has breadth of character carries the outer world.",
        "chinese": "地勢坤，君子以厚德載物。"
      },
      "lines": [
        {
          "position": 1,
          "text": "When there is hoarfrost underfoot, solid ice is not far off."
        },
        {
          "position": 2,
          "text": "Straight, square, great. Without purpose, yet nothing remains unfurthered."
        },
        {
          "position": 3,
          "text": "Hidden lines. One is able to remain persevering."
        },
        {
          "position": 4,
          "text": "A tied-up sack. No blame, no praise."
        },
        {
          "position": 5,
          "text": "A yellow lower garment brings supreme good fortune."
        },
        {
          "position": 6,
          "text": "Dragons fight in the meadow. Their blood is black and yellow."
        }
      ]
    },
    {
      "number": 3,
      "binary": "010001",
      "name": {
        "chinese": "屯",
        "pinyin": "zhūn",
        "english": "Difficulty at the Beginning"
      },
      "trigrams": {
        "upper": "010",
        "lower": "001"
      },
      "judgment": {
        "text": "Difficulty at the Beginning works supreme success, furthering through perseverance. Nothing should be undertaken. It furthers one to appoint helpers.",
        "chinese": "屯：元，亨，利，貞，勿用，有攸往，利建侯。"
      },
      "image": {
        "text": "Clouds and thunder: The image of Difficulty at the Beginning. Thus the superior man brings order out of confusion.",
        "chinese": "雲，雷，屯；君子以經綸。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Hesitation and hindrance. It furthers one to remain persevering. It furthers one to appoint helpers."
        },
        {
          "position": 2,
          "text": "Difficulties pile up. The girl is chaste; she does not pledge herself."
        },
        {
          "position": 3,
          "text": "Whoever hunts deer without the forester only loses his way in the forest."
        },
        {
          "position": 4,
          "text": "Horse and wagon part. Strive for union."
        },
        {
          "position": 5,
          "text": "Difficulties in blessing. A little perseverance brings good fortune. Great perseverance brings misfortune."
        },
        {
          "position": 6,
          "text": "Horse and wagon part. Bloody tears flow."
        }
      ]
    },
    {
      "number": 4,
      "binary": "100010",
      "name": {
        "chinese": "蒙",
        "pinyin": "méng",
        "english": "Youthful Folly"
      },
      "trigrams": {
        "upper": "100",
        "lower": "010"
      },
      "judgment": {
        "text": "Youthful Folly has success. It is not I who seek the young fool; the young fool seeks me. At the first oracle I inform him. If he asks two or three times, it is importunity.",
        "chinese": "蒙：亨。匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告。利貞。"
      },
      "image": {
        "text": "A spring wells up at the foot of the mountain. Thus the superior man fosters his character by thoroughness in all that he does.",
        "chinese": "山下出泉，蒙；君子以果行育德。"
      },
      "lines": [
        {
          "position": 1,
          "text": "To make a fool develop, it furthers one to apply discipline."
        },
        {
          "position": 2,
          "text": "To bear with fools in kindliness brings good fortune. To know how to take women brings good fortune."
        },
        {
          "position": 3,
          "text": "Take not a maiden who loses herself at the sight of a man of bronze."
        },
        {
          "position": 4,
          "text": "Entangled folly brings humiliation."
        },
        {
          "position": 5,
          "text": "Childlike folly brings good fortune."
        },
        {
          "position": 6,
          "text": "In punishing folly, it does not further one to commit transgressions."
        }
      ]
    },
    {
      "number": 5,
      "binary": "010111",
      "name": {
        "chinese": "需",
        "pinyin": "xū",
        "english": "Waiting"
      },
      "trigrams": {
        "upper": "010",
        "lower": "111"
      },
      "judgment": {
        "text": "Waiting. If you are sincere, you have light and success. Perseverance brings good fortune. It furthers one to cross the great water.",
        "chinese": "需：有孚，光亨，貞吉。利涉大川。"
      },
      "image": {
        "text": "Clouds rise up to heaven. The image of Waiting. Thus the superior man eats and drinks, is joyous and of good cheer.",
        "chinese": "雲上於天，需；君子以飲食宴樂。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Waiting in the meadow. It furthers one to abide in what endures. No blame."
        },
        {
          "position": 2,
          "text": "Waiting on the sand. There is some gossip. The end brings good fortune."
        },
        {
          "position": 3,
          "text": "Waiting in the mud brings about the arrival of the enemy."
        },
        {
          "position": 4,
          "text": "Waiting in blood. Get out of the pit."
        },
        {
          "position": 5,
          "text": "Waiting at meat and drink. Perseverance brings good fortune."
        },
        {
          "position": 6,
          "text": "One falls into the pit. Three uninvited guests arrive. Honor them, and in the end there will be good fortune."
        }
      ]
    },
    {
      "number": 6,
      "binary": "111010",
      "name": {
        "chinese": "訟",
        "pinyin": "sòng",
        "english": "Conflict"
      },
      "trigrams": {
        "upper": "111",
        "lower": "010"
      },
      "judgment": {
        "text": "Conflict. You are sincere and are being obstructed. A cautious halt halfway brings good fortune. Going through to the end brings misfortune.",
        "chinese": "訟：有孚，窒。惕中吉。終凶。利見大人，不利涉大川。"
      },
      "image": {
        "text": "Heaven and water go their opposite ways. Thus in all his transactions the superior man carefully considers the beginning.",
        "chinese": "天與水違行，訟；君子以作事謀始。"
      },
      "lines": [
        {
          "position": 1,
          "text": "If one does not perpetuate the affair, there is a little gossip. In the end, good fortune comes."
        },
        {
          "position": 2,
          "text": "One cannot engage in conflict. One returns home. The people of his town, three hundred households, remain free of guilt."
        },
        {
          "position": 3,
          "text": "To nourish oneself on ancient virtue induces perseverance. Danger. In the end, good fortune comes."
        },
        {
          "position": 4,
          "text": "One cannot engage in conflict. One turns back and submits to fate. Peace. Perseverance brings good fortune."
        },
        {
          "position": 5,
          "text": "To contend before him brings supreme good fortune."
        },
        {
          "position": 6,
          "text": "Even if by chance a leather belt is bestowed on one, by the end of a morning it will have been snatched away three times."
        }
      ]
    },
    {
      "number": 7,
      "binary": "000010",
      "name": {
        "chinese": "師",
        "pinyin": "shī",
        "english": "The Army"
      },
      "trigrams": {
        "upper": "000",
        "lower": "010"
      },
      "judgment": {
        "text": "The Army. The army needs perseverance and a strong man. Good fortune without blame.",
        "chinese": "師：貞，丈人吉，無咎。"
      },
      "image": {
        "text": "In the middle of the earth is water. Thus the superior man increases his masses by generosity toward the people.",
        "chinese": "地中有水，師；君子以容民畜眾。"
      },
      "lines": [
        {
          "position": 1,
          "text": "An army must set forth in proper order. If the order is not good, misfortune threatens."
        },
        {
          "position": 2,
          "text": "In the midst of the army. Good fortune. No blame. The king bestows a triple decoration."
        },
        {
          "position": 3,
          "text": "Perchance the army carries corpses in the wagon. Misfortune."
        },
        {
          "position": 4,
          "text": "The army retreats. No blame."
        },
        {
          "position": 5,
          "text": "There is game in the field. It furthers one to catch it. Without blame."
        },
        {
          "position": 6,
          "text": "The great prince issues commands, founds states, vests families with fiefs. Inferior people should not be employed."
        }
      ]
    },
    {
      "number": 8,
      "binary": "010000",
      "name": {
        "chinese": "比",
        "pinyin": "bǐ",
        "english": "Holding Together"
      },
      "trigrams": {
        "upper": "010",
        "lower": "000"
      },
      "judgment": {
        "text": "Holding Together brings good fortune. Inquire of the oracle once again whether you possess sublimity, constancy, and perseverance; then there is no blame.",
        "chinese": "比：吉。原筮元永貞，無咎。"
      },
      "image": {
        "text": "On the earth is water. Thus the kings of antiquity bestowed the different states as fiefs and cultivated friendly relations with the feudal lords.",
        "chinese": "地上有水，比；先王以建萬國，親諸侯。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Hold to him in truth and loyalty; this is without blame. Truth, like a full earthen bowl."
        },
        {
          "position": 2,
          "text": "Hold to him inwardly. Perseverance brings good fortune."
        },
        {
          "position": 3,
          "text": "You hold together with the wrong people."
        },
        {
          "position": 4,
          "text": "Hold to him outwardly also. Perseverance brings good fortune."
        },
        {
          "position": 5,
          "text": "Manifestation of holding together. In the hunt the king uses beaters on three sides only. The citizens need no warning. Good fortune."
        },
        {
          "position": 6,
          "text": "He finds no head for holding together. Misfortune."
        }
      ]
    },
    {
      "number": 9,
      "binary": "110111",
      "name": {
        "chinese": "小畜",
        "pinyin": "xiǎo chù",
        "english": "The Taming Power of the Small"
      },
      "trigrams": {
        "upper": "110",
        "lower": "111"
      },
      "judgment": {
        "text": "The Taming Power of the Small has success. Dense clouds, no rain from our western region.",
        "chinese": "小畜：亨。密雲不雨，自我西郊。"
      },
      "image": {
        "text": "The wind drives across heaven. Thus the superior man refines the outward aspect of his nature.",
        "chinese": "風行天上，小畜；君子以懿文德。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Return to the way. How could there be blame in this? Good fortune."
        },
        {
          "position": 2,
          "text": "He allows himself to be drawn into returning. Good fortune."
        },
        {
          "position": 3,
          "text": "The spokes burst out of the wagon wheels. Man and wife roll their eyes."
        },
        {
          "position": 4,
          "text": "If you are sincere, blood vanishes and fear gives way. No blame."
        },
        {
          "position": 5,
          "text": "If you are sincere and loyally attached, you are rich in your neighbor."
        },
        {
          "position": 6,
          "text": "The rain comes, there is rest. This is due to the lasting effect of character. The woman is in danger. The moon is nearly full."
        }
      ]
    },
    {
      "number": 10,
      "binary": "111011",
      "name": {
        "chinese": "履",
        "pinyin": "lǚ",
        "english": "Treading"
      },
      "trigrams": {
        "upper": "111",
        "lower": "011"
      },
      "judgment": {
        "text": "Treading upon the tail of the tiger. It does not bite the man. Success.",
        "chinese": "履：履虎尾，不咥人，亨。"
      },
      "image": {
        "text": "Heaven above, the lake below. Thus the superior man discriminates between high and low.",
        "chinese": "上天下澤，履；君子以辯上下，定民志。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Simple conduct. Progress without blame."
        },
        {
          "position": 2,
          "text": "Treading a smooth, level course. The perseverance of a dark man brings good fortune."
        },
        {
          "position": 3,
          "text": "A one-eyed man is able to see, a lame man is able to tread. But he treads on the tail of the tiger. Misfortune."
        },
        {
          "position": 4,
          "text": "He treads on the tail of the tiger. Caution and circumspection lead ultimately to good fortune."
        },
        {
          "position": 5,
          "text": "Resolute conduct. Perseverance with awareness of danger."
        },
        {
          "position": 6,
          "text": "Look to your conduct and weigh the favorable signs. When everything is fulfilled, supreme good fortune comes."
        }
      ]
    },
    {
      "number": 11,
      "binary": "000111",
      "name": {
        "chinese": "泰",
        "pinyin": "tài",
        "english": "Peace"
      },
      "trigrams": {
        "upper": "000",
        "lower": "111"
      },
      "judgment": {
        "text": "Peace. The small departs, the great approaches. Good fortune. Success.",
        "chinese": "泰：小往大來，吉亨。"
      },
      "image": {
        "text": "Heaven and earth unite: Peace. Thus the ruler divides and completes the course of heaven and earth.",
        "chinese": "天地交，泰；后以財成天地之道。"
      },
      "lines": [
        {
          "position": 1,
          "text": "When ribbon grass is pulled up, the sod comes with it. Undertakings bring good fortune."
        },
        {
          "position": 2,
          "text": "Bearing with the uncultured in gentleness, fording the river with resolution. One does not neglect what is distant."
        },
        {
          "position": 3,
          "text": "No plain not followed by a slope. No going not followed by a return. He who remains persevering in danger is without blame."
        },
        {
          "position": 4,
          "text": "He flutters down, not boasting of his wealth, together with his neighbor, guileless and sincere."
        },
        {
          "position": 5,
          "text": "The sovereign I gives his daughter in marriage. This brings blessing and supreme good fortune."
        },
        {
          "position": 6,
          "text": "The wall falls back into the moat. Use no army now. Make your commands known within your own town. Perseverance brings humiliation."
        }
      ]
    },
    {
      "number": 12,
      "binary": "111000",
      "name": {
        "chinese": "否",
        "pinyin": "pǐ",
        "english": "Standstill"
      },
      "trigrams": {
        "upper": "111",
        "lower": "000"
      },
      "judgment": {
        "text": "Standstill. Evil people do not further the perseverance of the superior man. The great departs; the small approaches.",
        "chinese": "否：否之匪人，不利君子貞，大往小來。"
      },
      "image": {
        "text": "Heaven and earth do not unite: Standstill. Thus the superior man falls back upon his inner worth.",
        "chinese": "天地不交，否；君子以儉德辟難。"
      },
      "lines": [
        {
          "position": 1,
          "text": "When ribbon grass is pulled up, the sod comes with it. Perseverance brings good fortune and success."
        },
        {
          "position": 2,
          "text": "They bear and endure; this means good fortune for inferior people. The standstill serves to help the great man to attain success."
        },
        {
          "position": 3,
          "text": "They bear shame."
        },
        {
          "position": 4,
          "text": "He who acts at the command of the highest remains without blame. Those of like mind partake of the blessing."
        },
        {
          "position": 5,
          "text": "Standstill is giving way. Good fortune for the great man. What if it should fail? He ties it to a cluster of mulberry shoots."
        },
        {
          "position": 6,
          "text": "The standstill comes to an end. First standstill, then good fortune."
        }
      ]
    },
    {
      "number": 13,
      "binary": "111101",
      "name": {
        "chinese": "同人",
        "pinyin": "tóng rén",
        "english": "Fellowship with Men"
      },
      "trigrams": {
        "upper": "111",
        "lower": "101"
      },
      "judgment": {
        "text": "Fellowship with Men in the open. Success. It furthers one to cross the great water.",
        "chinese": "同人：同人于野，亨。利涉大川，利君子貞。"
      },
      "image": {
        "text": "Heaven together with fire. Thus the superior man organizes the clans and makes distinctions between things.",
        "chinese": "天與火，同人；君子以類族辨物。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Fellowship with men at the gate. No blame."
        },
        {
          "position": 2,
          "text": "Fellowship with men in the clan. Humiliation."
        },
        {
          "position": 3,
          "text": "He hides weapons in the thicket; he climbs the high hill in front of it. For three years he does not rise up."
        },
        {
          "position": 4,
          "text": "He climbs up on his wall; he cannot attack. Good fortune."
        },
        {
          "position": 5,
          "text": "Men bound in fellowship first weep and lament, but afterward they laugh. Great armies can meet and join together."
        },
        {
          "position": 6,
          "text": "Fellowship with men in the meadow. No remorse."
        }
      ]
    },
    {
      "number": 14,
      "binary": "101111",
      "name": {
        "chinese": "大有",
        "pinyin": "dà yǒu",
        "english": "Possession in Great Measure"
      },
      "trigrams": {
        "upper": "101",
        "lower": "111"
      },
      "judgment": {
        "text": "Possession in Great Measure. Supreme success.",
        "chinese": "大有：元亨。"
      },
      "image": {
        "text": "Fire in heaven above. Thus the superior man curbs evil and furthers good.",
        "chinese": "火在天上，大有；君子以遏惡揚善。"
      },
      "lines": [
        {
          "position": 1,
          "text": "No relationship with what is harmful; there is no blame in this. If one remains conscious of difficulty, one remains without blame."
        },
        {
          "position": 2,
          "text": "A big wagon for loading. One may undertake something. No blame."
        },
        {
          "position": 3,
          "text": "A prince offers it to the Son of Heaven. A petty man cannot do this."
        },
        {
          "position": 4,
          "text": "He makes a difference between himself and his neighbor. No blame."
        },
        {
          "position": 5,
          "text": "He whose truth is accessible, yet dignified, has good fortune."
        },
        {
          "position": 6,
          "text": "He is blessed by heaven. Good fortune. Nothing that does not further."
        }
      ]
    },
    {
      "number": 15,
      "binary": "000100",
      "name": {
        "chinese": "謙",
        "pinyin": "qiān",
        "english": "Modesty"
      },
      "trigrams": {
        "upper": "000",
        "lower": "100"
      },
      "judgment": {
        "text": "Modesty creates success. The superior man carries things through.",
        "chinese": "謙：亨，君子有終。"
      },
      "image": {
        "text": "Within the earth, a mountain. Thus the superior man reduces that which is too much, and augments that which is too little.",
        "chinese": "地中有山，謙；君子以裒多益寡。"
      },
      "lines": [
        {
          "position": 1,
          "text": "A superior man modest about his modesty may cross the great water. Good fortune."
        },
        {
          "position": 2,
          "text": "Modesty that comes to expression. Perseverance brings good fortune."
        },
        {
          "position": 3,
          "text": "A superior man of modesty and merit carries things to conclusion. Good fortune."
        },
        {
          "position": 4,
          "text": "Nothing that would not further modesty in movement."
        },
        {
          "position": 5,
          "text": "No boasting of wealth before one's neighbor. It is favorable to attack with force. Nothing that would not further."
        },
        {
          "position": 6,
          "text": "Modesty that comes to expression. It is favorable to set armies marching to chastise one's own city and one's country."
        }
      ]
    },
    {
      "number": 16,
      "binary": "001000",
      "name": {
        "chinese": "豫",
        "pinyin": "yù",
        "english": "Enthusiasm"
      },
      "trigrams": {
        "upper": "001",
        "lower": "000"
      },
      "judgment": {
        "text": "Enthusiasm. It furthers one to install helpers and to set armies marching.",
        "chinese": "豫：利建侯行師。"
      },
      "image": {
        "text": "Thunder comes resounding out of the earth. Thus the ancient kings made music to honor merit.",
        "chinese": "雷出地奮，豫；先王以作樂崇德。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Enthusiasm that expresses itself brings misfortune."
        },
        {
          "position": 2,
          "text": "Firm as a rock. Not a whole day. Perseverance brings good fortune."
        },
        {
          "position": 3,
          "text": "Enthusiasm that looks upward creates remorse. Hesitation brings remorse."
        },
        {
          "position": 4,
          "text": "The source of enthusiasm. He achieves great things. Doubt not. You gather friends around you as a hair clasp gathers the hair."
        },
        {
          "position": 5,
          "text": "Persistently ill, and still does not die."
        },
        {
          "position": 6,
          "text": "Deluded enthusiasm. But if after completion one changes, there is no blame."
        }
      ]
    },
    {
      "number": 17,
      "binary": "011001",
      "name": {
        "chinese": "隨",
        "pinyin": "suí",
        "english": "Following"
      },
      "trigrams": {
        "upper": "011",
        "lower": "001"
      },
      "judgment": {
        "text": "Following has supreme success. Perseverance furthers. No blame.",
        "chinese": "隨：元亨利貞，無咎。"
      },
      "image": {
        "text": "Thunder in the middle of the lake. Thus the superior man at nightfall goes indoors for rest and recuperation.",
        "chinese": "澤中有雷，隨；君子以嚮晦入宴息。"
      },
      "lines": [
        {
          "position": 1,
          "text": "The standard is changing. Perseverance brings good fortune. To go out of the door in company produces deeds."
        },
        {
          "position": 2,
          "text": "If one clings to the small boy, one loses the strong man."
        },
        {
          "position": 3,
          "text": "If one clings to the strong man, one loses the small boy. Through following one finds what one seeks."
        },
        {
          "position": 4,
          "text": "Following creates success. Perseverance brings misfortune. To go one's way with sincerity brings clarity. How could there be blame?"
        },
        {
          "position": 5,
          "text": "Sincere in the good. Good fortune."
        },
        {
          "position": 6,
          "text": "He meets with firm allegiance and is still further bound. The king introduces him to the Western Mountain."
        }
      ]
    },
    {
      "number": 18,
      "binary": "100110",
      "name": {
        "chinese": "蠱",
        "pinyin": "gǔ",
        "english": "Work on What Has Been Spoiled"
      },
      "trigrams": {
        "upper": "100",
        "lower": "110"
      },
      "judgment": {
        "text": "Work on What Has Been Spoiled has supreme success. It furthers one to cross the great water. Before the starting point, three days. After the starting point, three days.",
        "chinese": "蠱：元亨，利涉大川。先甲三日，後甲三日。"
      },
      "image": {
        "text": "The wind blows low on the mountain. Thus the superior man stirs up the people and strengthens their spirit.",
        "chinese": "山下有風，蠱；君子以振民育德。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Setting right what has been spoiled by the father. If there is a son, no blame rests upon the departed father."
        },
        {
          "position": 2,
          "text": "Setting right what has been spoiled by the mother. One must not be too persevering."
        },
        {
          "position": 3,
          "text": "Setting right what has been spoiled by the father. There will be a little remorse. No great blame."
        },
        {
          "position": 4,
          "text": "Tolerating what has been spoiled by the father. In continuing one sees humiliation."
        },
        {
          "position": 5,
          "text": "Setting right what has been spoiled by the father. One meets with praise."
        },
        {
          "position": 6,
          "text": "He does not serve kings and princes, sets himself higher goals."
        }
      ]
    },
    {
      "number": 19,
      "binary": "000011",
      "name": {
        "chinese": "臨",
        "pinyin": "lín",
        "english": "Approach"
      },
      "trigrams": {
        "upper": "000",
        "lower": "011"
      },
      "judgment": {
        "text": "Approach has supreme success. Perseverance furthers. When the eighth month comes, there will be misfortune.",
        "chinese": "臨：元，亨，利，貞。至于八月有凶。"
      },
      "image": {
        "text": "The earth above the lake. Thus the superior man is inexhaustible in his will to teach, and without limits in his tolerance.",
        "chinese": "地上有澤，臨；君子以教思無窮，容保民無疆。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Joint approach. Perseverance brings good fortune."
        },
        {
          "position": 2,
          "text": "Joint approach. Good fortune. Everything furthers."
        },
        {
          "position": 3,
          "text": "Comfortable approach. Nothing that would further. If one is induced to grieve over it, one becomes free of blame."
        },
        {
          "position": 4,
          "text": "Complete approach. No blame."
        },
        {
          "position": 5,
          "text": "Wise approach. This is right for a great prince. Good fortune."
        },
        {
          "position": 6,
          "text": "Great-hearted approach. Good fortune. No blame."
        }
      ]
    },
    {
      "number": 20,
      "binary": "110000",
      "name": {
        "chinese": "觀",
        "pinyin": "guān",
        "english": "Contemplation"
      },
      "trigrams": {
        "upper": "110",
        "lower": "000"
      },
      "judgment": {
        "text": "Contemplation. The ablution has been made, but not yet the offering. Full of trust they look up to him.",
        "chinese": "觀：盥而不薦，有孚顒若。"
      },
      "image": {
        "text": "The wind blows over the earth. Thus the kings of old visited the regions of the world, contemplated the people, and gave them instruction.",
        "chinese": "風行地上，觀；先王以省方觀民設教。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Boy-like contemplation. For an inferior man, no blame. For a superior man, humiliation."
        },
        {
          "position": 2,
          "text": "Contemplation through the crack of the door. Furthering for the perseverance of a woman."
        },
        {
          "position": 3,
          "text": "Contemplation of my life decides the choice between advance and retreat."
        },
        {
          "position": 4,
          "text": "Contemplation of the light of the kingdom. It furthers one to exert influence as the guest of a king."
        },
        {
          "position": 5,
          "text": "Contemplation of my life. The superior man is without blame."
        },
        {
          "position": 6,
          "text": "Contemplation of his life. The superior man is without blame."
        }
      ]
    },
    {
      "number": 21,
      "binary": "101001",
      "name": {
        "chinese": "噬嗑",
        "pinyin": "shì kè",
        "english": "Biting Through"
      },
      "trigrams": {
        "upper": "101",
        "lower": "001"
      },
      "judgment": {
        "text": "Biting Through has success. It is favorable to let justice be administered.",
        "chinese": "噬嗑：亨。利用獄。"
      },
      "image": {
        "text": "Thunder and lightning: Biting Through. Thus the kings of former times made firm the laws through clearly defined penalties.",
        "chinese": "雷電，噬嗑；先王以明罰敕法。"
      },
      "lines": [
        {
          "position": 1,
          "text": "His feet are fastened in the stocks, so that his toes disappear. No blame."
        },
        {
          "position": 2,
          "text": "Bites through tender meat, so that his nose disappears. No blame."
        },
        {
          "position": 3,
          "text": "Bites on old dried meat and strikes on something poisonous. Slight humiliation. No blame."
        },
        {
          "position": 4,
          "text": "Bites on dried gristly meat. Receives metal arrows. It furthers one to be mindful of difficulties and to be persevering. Good fortune."
        },
        {
          "position": 5,
          "text": "Bites on dried lean meat. Receives yellow gold. Perseveringly aware of danger. No blame."
        },
        {
          "position": 6,
          "text": "His neck is fastened in the wooden cangue, so that his ears disappear. Misfortune."
        }
      ]
    },
    {
      "number": 22,
      "binary": "100101",
      "name": {
        "chinese": "賁",
        "pinyin": "bì",
        "english": "Grace"
      },
      "trigrams": {
        "upper": "100",
        "lower": "101"
      },
      "judgment": {
        "text": "Grace has success. In small matters it is favorable to undertake something.",
        "chinese": "賁：亨。小利有攸往。"
      },
      "image": {
        "text": "Fire at the foot of the mountain. Thus the superior man proceeds to clear up current affairs. But he dare not decide controversial issues in this way.",
        "chinese": "山下有火，賁；君子以明庶政，無敢折獄。"
      },
      "lines": [
        {
          "position": 1,
          "text": "He lends grace to his toes, leaves the carriage, and walks."
        },
        {
          "position": 2,
          "text": "Lends grace to the beard on his chin."
        },
        {
          "position": 3,
          "text": "Graceful and moist. Constant perseverance brings good fortune."
        },
        {
          "position": 4,
          "text": "Grace or simplicity? A white horse comes as if on wings. He is not a robber; he will woo at the right time."
        },
        {
          "position": 5,
          "text": "Grace in hills and gardens. The roll of silk is meager and small. Humiliation, but in the end good fortune."
        },
        {
          "position": 6,
          "text": "Simple grace. No blame."
        }
      ]
    },
    {
      "number": 23,
      "binary": "100000",
      "name": {
        "chinese": "剝",
        "pinyin": "bō",
        "english": "Splitting Apart"
      },
      "trigrams": {
        "upper": "100",
        "lower": "000"
      },
      "judgment": {
        "text": "Splitting Apart. It does not further one to go anywhere.",
        "chinese": "剝：不利有攸往。"
      },
      "image": {
        "text": "The mountain rests on the earth. Thus those above can ensure their position only by giving generously to those below.",
        "chinese": "山附於地，剝；上以厚下安宅。"
      },
      "lines": [
        {
          "position": 1,
          "text": "The leg of the bed is split. Those who persevere are destroyed. Misfortune."
        },
        {
          "position": 2,
          "text": "The bed is split at the edge. Those who persevere are destroyed. Misfortune."
        },
        {
          "position": 3,
          "text": "He splits with them. No blame."
        },
        {
          "position": 4,
          "text": "The bed is split up to the skin. Misfortune."
        },
        {
          "position": 5,
          "text": "A shoal of fishes. Favor comes through the court ladies. Everything acts to further."
        },
        {
          "position": 6,
          "text": "There is a large fruit still uneaten. The superior man receives a carriage. The house of the inferior man is split apart."
        }
      ]
    },
    {
      "number": 24,
      "binary": "000001",
      "name": {
        "chinese": "復",
        "pinyin": "fù",
        "english": "Return"
      },
      "trigrams": {
        "upper": "000",
        "lower": "001"
      },
      "judgment": {
        "text": "Return. Success. Going out and coming in without error. Friends come without blame. To and fro goes the way. On the seventh day comes return.",
        "chinese": "復：亨。出入無疾，朋來無咎。反復其道，七日來復，利有攸往。"
      },
      "image": {
        "text": "Thunder within the earth. Thus the kings of old closed the passes at the time of solstice.",
        "chinese": "雷在地中，復；先王以至日閉關。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Return from a short distance. No need for remorse. Great good fortune."
        },
        {
          "position": 2,
          "text": "Quiet return. Good fortune."
        },
        {
          "position": 3,
          "text": "Repeated return. Danger. No blame."
        },
        {
          "position": 4,
          "text": "Walking in the midst of others, one returns alone."
        },
        {
          "position": 5,
          "text": "Noble-hearted return. No remorse."
        },
        {
          "position": 6,
          "text": "Missing the return. Misfortune. If armies are set marching in this way, one will suffer a great defeat."
        }
      ]
    },
    {
      "number": 25,
      "binary": "111001",
      "name": {
        "chinese": "無妄",
        "pinyin": "wú wàng",
        "english": "Innocence"
      },
      "trigrams": {
        "upper": "111",
        "lower": "001"
      },
      "judgment": {
        "text": "Innocence. Supreme success. Perseverance furthers. If someone is not as he should be, he has misfortune.",
        "chinese": "無妄：元，亨，利，貞。其匪正有眚，不利有攸往。"
      },
      "image": {
        "text": "Under heaven, thunder rolls. Thus the kings of old, rich in virtue and in harmony with the time, fostered and nourished all beings.",
        "chinese": "天下雷行，物與無妄；先王以茂對時育萬物。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Innocent behavior brings good fortune."
        },
        {
          "position": 2,
          "text": "If one does not count on the harvest while plowing, then it furthers one to undertake something."
        },
        {
          "position": 3,
          "text": "Undeserved misfortune. The cow that was tethered by someone is the wanderer's gain, the citizen's loss."
        },
        {
          "position": 4,
          "text": "He who can be persevering remains without blame."
        },
        {
          "position": 5,
          "text": "Use no medicine in an illness incurred through no fault of your own. It will pass of itself."
        },
        {
          "position": 6,
          "text": "Innocent action brings misfortune. Nothing furthers."
        }
      ]
    },
    {
      "number": 26,
      "binary": "100111",
      "name": {
        "chinese": "大畜",
        "pinyin": "dà chù",
        "english": "The Taming Power of the Great"
      },
      "trigrams": {
        "upper": "100",
        "lower": "111"
      },
      "judgment": {
        "text": "The Taming Power of the Great. Perseverance furthers. Not eating at home brings good fortune. It furthers one to cross the great water.",
        "chinese": "大畜：利貞，不家食吉，利涉大川。"
      },
      "image": {
        "text": "Heaven within the mountain. Thus the superior man acquaints himself with many sayings of antiquity and many deeds of the past.",
        "chinese": "天在山中，大畜；君子以多識前言往行，以畜其德。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Danger is at hand. It furthers one to desist."
        },
        {
          "position": 2,
          "text": "The axletrees are taken from the wagon."
        },
        {
          "position": 3,
          "text": "A good horse that follows others. Awareness of danger, with perseverance, furthers. Practice chariot driving and armed defense daily."
        },
        {
          "position": 4,
          "text": "The headboard of a young bull. Great good fortune."
        },
        {
          "position": 5,
          "text": "The tusk of a gelded boar. Good fortune."
        },
        {
          "position": 6,
          "text": "One attains the way of heaven. Success."
        }
      ]
    },
    {
      "number": 27,
      "binary": "100001",
      "name": {
        "chinese": "頤",
        "pinyin": "yí",
        "english": "The Corners of the Mouth"
      },
      "trigrams": {
        "upper": "100",
        "lower": "001"
      },
      "judgment": {
        "text": "The Corners of the Mouth. Perseverance brings good fortune. Pay heed to the providing of nourishment and to what a man seeks to fill his own mouth with.",
        "chinese": "頤：貞吉。觀頤，自求口實。"
      },
      "image": {
        "text": "At the foot of the mountain, thunder. Thus the superior man is careful of his words and temperate in eating and drinking.",
        "chinese": "山下有雷，頤；君子以慎言語，節飲食。"
      },
      "lines": [
        {
          "position": 1,
          "text": "You let your magic tortoise go, and look at me with the corners of your mouth drooping. Misfortune."
        },
        {
          "position": 2,
          "text": "Turning to the summit for nourishment. Deviating from the path to seek nourishment from the hill. Continuing to do this brings misfortune."
        },
        {
          "position": 3,
          "text": "Turning away from nourishment. Perseverance brings misfortune. Do not act thus for ten years. Nothing serves to further."
        },
        {
          "position": 4,
          "text": "Turning to the summit for provision of nourishment brings good fortune. Spying about with sharp eyes like a tiger with insatiable craving. No blame."
        },
        {
          "position": 5,
          "text": "Turning away from the path. To remain persevering brings good fortune. One should not cross the great water."
        },
        {
          "position": 6,
          "text": "The source of nourishment. Awareness of danger brings good fortune. It furthers one to cross the great water."
        }
      ]
    },
    {
      "number": 28,
      "binary": "011110",
      "name": {
        "chinese": "大過",
        "pinyin": "dà guò",
        "english": "Preponderance of the Great"
      },
      "trigrams": {
        "upper": "011",
        "lower": "110"
      },
      "judgment": {
        "text": "Preponderance of the Great. The ridgepole sags to the breaking point. It furthers one to have somewhere to go. Success.",
        "chinese": "大過：棟橈。利有攸往，亨。"
      },
      "image": {
        "text": "The lake rises above the trees. Thus the superior man, when he stands alone, is unconcerned, and if he has to renounce the world, he is undaunted.",
        "chinese": "澤滅木，大過；君子以獨立不懼，遁世無悶。"
      },
      "lines": [
        {
          "position": 1,
          "text": "To spread white rushes underneath. No blame."
        },
        {
          "position": 2,
          "text": "A dry poplar sprouts at the root. An older man takes a young wife. Everything furthers."
        },
        {
          "position": 3,
          "text": "The ridgepole sags to the breaking point. Misfortune."
        },
        {
          "position": 4,
          "text": "The ridgepole is braced. Good fortune. If there are ulterior motives, it is humiliating."
        },
        {
          "position": 5,
          "text": "A withered poplar puts forth flowers. An older woman takes a young husband. No blame. No praise."
        },
        {
          "position": 6,
          "text": "One must go through the water. It goes over one's head. Misfortune. No blame."
        }
      ]
    },
    {
      "number": 29,
      "binary": "010010",
      "name": {
        "chinese": "坎",
        "pinyin": "kǎn",
        "english": "The Abysmal"
      },
      "trigrams": {
        "upper": "010",
        "lower": "010"
      },
      "judgment": {
        "text": "The Abysmal repeated. If you are sincere, you have success in your heart, and whatever you do succeeds.",
        "chinese": "坎：習坎，有孚，維心亨，行有尚。"
      },
      "image": {
        "text": "Water flows on and reaches the goal. Thus the superior man walks in lasting virtue and carries on the business of teaching.",
        "chinese": "水洊至，習坎；君子以常德行，習教事。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Repetition of the Abysmal. In the abyss one falls into a pit. Misfortune."
        },
        {
          "position": 2,
          "text": "The abyss is dangerous. One should strive to attain small things only."
        },
        {
          "position": 3,
          "text": "Forward and backward, abyss on abyss. In danger like this, pause at first and wait. Otherwise you will fall into a pit in the abyss. Do not act in this way."
        },
        {
          "position": 4,
          "text": "A jug of wine, a bowl of rice with it; earthen vessels simply handed in through the window. There is certainly no blame in this."
        },
        {
          "position": 5,
          "text": "The abyss is not filled to overflowing, it is filled only to the rim. No blame."
        },
        {
          "position": 6,
          "text": "Bound with cords and ropes, shut in between thorn-hedged prison walls. For three years one does not find the way. Misfortune."
        }
      ]
    },
    {
      "number": 30,
      "binary": "101101",
      "name": {
        "chinese": "離",
        "pinyin": "lí",
        "english": "The Clinging"
      },
      "trigrams": {
        "upper": "101",
        "lower": "101"
      },
      "judgment": {
        "text": "The Clinging. Perseverance furthers. It brings success. Care of the cow brings good fortune.",
        "chinese": "離：利貞，亨。畜牝牛，吉。"
      },
      "image": {
        "text": "That which is bright rises twice: The Clinging. Thus the great man, by perpetuating this brightness, illumines the four quarters of the world.",
        "chinese": "明兩作，離；大人以繼明照于四方。"
      },
      "lines": [
        {
          "position": 1,
          "text": "The footprints run crisscross. If one is seriously intent, no blame."
        },
        {
          "position": 2,
          "text": "Yellow light. Supreme good fortune."
        },
        {
          "position": 3,
          "text": "In the light of the setting sun, men either beat the pot and sing or loudly bewail the approach of old age. Misfortune."
        },
        {
          "position": 4,
          "text": "Its coming is sudden; it flames up, dies down, is thrown away."
        },
        {
          "position": 5,
          "text": "Tears in floods, sighing and lamenting. Good fortune."
        },
        {
          "position": 6,
          "text": "The king uses him to march forth and chastise. It is best to kill the leaders and take captive the followers. No blame."
        }
      ]
    },
    {
      "number": 31,
      "binary": "011100",
      "name": {
        "chinese": "咸",
        "pinyin": "xián",
        "english": "Influence"
      },
      "trigrams": {
        "upper": "011",
        "lower": "100"
      },
      "judgment": {
        "text": "Influence. Success. Perseverance furthers. To take a maiden to wife brings good fortune.",
        "chinese": "咸：亨，利貞，取女吉。"
      },
      "image": {
        "text": "A lake on the mountain. Thus the superior man encourages people to approach him by his readiness to receive them.",
        "chinese": "山上有澤，咸；君子以虛受人。"
      },
      "lines": [
        {
          "position": 1,
          "text": "The influence shows itself in the big toe."
        },
        {
          "position": 2,
          "text": "The influence shows itself in the calves of the legs. Misfortune. Tarrying brings good fortune."
        },
        {
          "position": 3,
          "text": "The influence shows itself in the thighs. Holds to that which follows it. To continue is humiliating."
        },
        {
          "position": 4,
          "text": "Perseverance brings good fortune. Remorse disappears. If a man is agitated in mind and his thoughts go hither and thither, only those friends on whom he fixes his conscious thoughts will follow."
        },
        {
          "position": 5,
          "text": "The influence shows itself in the back of the neck. No remorse."
        },
        {
          "position": 6,
          "text": "The influence shows itself in the jaws, cheeks, and tongue."
        }
      ]
    },
    {
      "number": 32,
      "binary": "001110",
      "name": {
        "chinese": "恆",
        "pinyin": "héng",
        "english": "Duration"
      },
      "trigrams": {
        "upper": "001",
        "lower": "110"
      },
      "judgment": {
        "text": "Duration. Success. No blame. Perseverance furthers. It furthers one to have somewhere to go.",
        "chinese": "恆：亨，無咎，利貞，利有攸往。"
      },
      "image": {
        "text": "Thunder and wind: Duration. Thus the superior man stands firm and does not change his direction.",
        "chinese": "雷風，恆；君子以立不易方。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Seeking duration too hastily brings misfortune persistently. Nothing that would further."
        },
        {
          "position": 2,
          "text": "Remorse disappears."
        },
        {
          "position": 3,
          "text": "He who does not give duration to his character meets with disgrace. Persistent humiliation."
        },
        {
          "position": 4,
          "text": "No game in the field."
        },
        {
          "position": 5,
          "text": "Giving duration to one's character through perseverance. This is good fortune for a woman, misfortune for a man."
        },
        {
          "position": 6,
          "text": "Restlessness as an enduring condition brings misfortune."
        }
      ]
    },
    {
      "number": 33,
      "binary": "111100",
      "name": {
        "chinese": "遯",
        "pinyin": "dùn",
        "english": "Retreat"
      },
      "trigrams": {
        "upper": "111",
        "lower": "100"
      },
      "judgment": {
        "text": "Retreat. Success. In what is small, perseverance furthers.",
        "chinese": "遯：亨，小利貞。"
      },
      "image": {
        "text": "Mountain under heaven. Thus the superior man keeps the inferior man at a distance, not angrily but with reserve.",
        "chinese": "天下有山，遯；君子以遠小人，不惡而嚴。"
      },
      "lines": [
        {
          "position": 1,
          "text": "At the tail in retreat. This is dangerous. One must not wish to undertake anything."
        },
        {
          "position": 2,
          "text": "He holds him fast with yellow oxhide. No one can tear him loose."
        },
        {
          "position": 3,
          "text": "A halted retreat is nerve-wracking and dangerous. To retain people as men- and maidservants brings good fortune."
        },
        {
          "position": 4,
          "text": "Voluntary retreat brings good fortune to the superior man and downfall to the inferior man."
        },
        {
          "position": 5,
          "text": "Friendly retreat. Perseverance brings good fortune."
        },
        {
          "position": 6,
          "text": "Cheerful retreat. Everything serves to further."
        }
      ]
    },
    {
      "number": 34,
      "binary": "001111",
      "name": {
        "chinese": "大壯",
        "pinyin": "dà zhuàng",
        "english": "The Power of the Great"
      },
      "trigrams": {
        "upper": "001",
        "lower": "111"
      },
      "judgment": {
        "text": "The Power of the Great. Perseverance furthers.",
        "chinese": "大壯：利貞。"
      },
      "image": {
        "text": "Thunder in heaven above. Thus the superior man does not tread upon paths that do not accord with established order.",
        "chinese": "雷在天上，大壯；君子以非禮弗履。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Power in the toes. Continuing brings misfortune. This is certainly true."
        },
        {
          "position": 2,
          "text": "Perseverance brings good fortune."
        },
        {
          "position": 3,
          "text": "The inferior man works through power. The superior man does not act thus. To continue is dangerous. A goat butts against a hedge and gets its horns entangled."
        },
        {
          "position": 4,
          "text": "Perseverance brings good fortune. Remorse disappears. The hedge opens; there is no entanglement. Power depends upon the axle of a big cart."
        },
        {
          "position": 5,
          "text": "Loses the goat with ease. No remorse."
        },
        {
          "position": 6,
          "text": "A goat butts against a hedge. It cannot go backward, it cannot go forward. Nothing serves to further. If one notes the difficulty, this brings good fortune."
        }
      ]
    },
    {
      "number": 35,
      "binary": "101000",
      "name": {
        "chinese": "晉",
        "pinyin": "jìn",
        "english": "Progress"
      },
      "trigrams": {
        "upper": "101",
        "lower": "000"
      },
      "judgment": {
        "text": "Progress. The powerful prince is honored with horses in large numbers. In a single day he is granted audience three times.",
        "chinese": "晉：康侯用錫馬蕃庶，晝日三接。"
      },
      "image": {
        "text": "The sun rises over the earth. Thus the superior man himself brightens his bright virtue.",
        "chinese": "明出地上，晉；君子以自昭明德。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Progressing, but turned back. Perseverance brings good fortune. If one meets with no confidence, one should remain calm. No mistake."
        },
        {
          "position": 2,
          "text": "Progressing, but in sorrow. Perseverance brings good fortune. Then one obtains great happiness from one's ancestress."
        },
        {
          "position": 3,
          "text": "All are in accord. Remorse disappears."
        },
        {
          "position": 4,
          "text": "Progress like a hamster. Perseverance brings danger."
        },
        {
          "position": 5,
          "text": "Remorse disappears. Take not gain and loss to heart. Undertakings bring good fortune. Everything serves to further."
        },
        {
          "position": 6,
          "text": "Making progress with the horns is permissible only for the purpose of punishing one's own city. To be conscious of danger brings good fortune. No blame. Perseverance brings humiliation."
        }
      ]
    },
    {
      "number": 36,
      "binary": "000101",
      "name": {
        "chinese": "明夷",
        "pinyin": "míng yí",
        "english": "Darkening of the Light"
      },
      "trigrams": {
        "upper": "000",
        "lower": "101"
      },
      "judgment": {
        "text": "Darkening of the Light. In adversity it furthers one to be persevering.",
        "chinese": "明夷：利艱貞。"
      },
      "image": {
        "text": "The light has sunk into the earth. Thus does the superior man live with the great mass: he veils his light, yet still shines.",
        "chinese": "明入地中，明夷；君子以蒞眾，用晦而明。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Darkening of the light during flight. He lowers his wings. The superior man does not eat for three days on his wanderings. But he has somewhere to go. The host has occasion to gossip."
        },
        {
          "position": 2,
          "text": "Darkening of the light injures him in the left thigh. He gives aid with the strength of a horse. Good fortune."
        },
        {
          "position": 3,
          "text": "Darkening of the light during the hunt in the south. Their great leader is captured. One must not expect perseverance too soon."
        },
        {
          "position": 4,
          "text": "He penetrates the left side of the belly. One gets at the very heart of the darkening of the light, and leaves gate and courtyard."
        },
        {
          "position": 5,
          "text": "Darkening of the light as with Prince Chi. Perseverance furthers."
        },
        {
          "position": 6,
          "text": "Not light but darkness. First he climbed up to heaven, then he plunged into the depths of the earth."
        }
      ]
    },
    {
      "number": 37,
      "binary": "110101",
      "name": {
        "chinese": "家人",
        "pinyin": "jiā rén",
        "english": "The Family"
      },
      "trigrams": {
        "upper": "110",
        "lower": "101"
      },
      "judgment": {
        "text": "The Family. The perseverance of the woman furthers.",
        "chinese": "家人：利女貞。"
      },
      "image": {
        "text": "Wind comes forth from fire. Thus the superior man has substance in his words and duration in his way of life.",
        "chinese": "風自火出，家人；君子以言有物而行有恆。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Firm seclusion within the family. Remorse disappears."
        },
        {
          "position": 2,
          "text": "She should not follow her whims. She must attend within to the food. Perseverance brings good fortune."
        },
        {
          "position": 3,
          "text": "When tempers flare up in the family, too great severity brings remorse. Good fortune nonetheless. When woman and child dally and laugh, it leads in the end to humiliation."
        },
        {
          "position": 4,
          "text": "She is the treasure of the house. Great good fortune."
        },
        {
          "position": 5,
          "text": "As a king he approaches his family. Fear not. Good fortune."
        },
        {
          "position": 6,
          "text": "His work commands respect. In the end good fortune comes."
        }
      ]
    },
    {
      "number": 38,
      "binary": "101011",
      "name": {
        "chinese": "睽",
        "pinyin": "kuí",
        "english": "Opposition"
      },
      "trigrams": {
        "upper": "101",
        "lower": "011"
      },
      "judgment": {
        "text": "Opposition. In small matters, good fortune.",
        "chinese": "睽：小事吉。"
      },
      "image": {
        "text": "Above, fire; below, the lake. Thus amid all fellowship the superior man retains his individuality.",
        "chinese": "上火下澤，睽；君子以同而異。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Remorse disappears. If you lose your horse, do not run after it; it will come back of its own accord."
        },
        {
          "position": 2,
          "text": "One meets his lord in a narrow street. No blame."
        },
        {
          "position": 3,
          "text": "One sees the wagon dragged back, the oxen halted, a man's hair and nose cut off. Not a good beginning, but a good end."
        },
        {
          "position": 4,
          "text": "Isolated through opposition, one meets a like-minded man with whom one can associate in good faith. Despite the danger, no blame."
        },
        {
          "position": 5,
          "text": "Remorse disappears. The companion bites his way through the wrappings. If one goes to him, how could it be a mistake?"
        },
        {
          "position": 6,
          "text": "Isolated through opposition. One sees one's companion as a pig covered with dirt, as a wagon full of devils. First one draws a bow against him, then one lays the bow aside. He is not a robber; he will woo at the right time."
        }
      ]
    },
    {
      "number": 39,
      "binary": "010100",
      "name": {
        "chinese": "蹇",
        "pinyin": "jiǎn",
        "english": "Obstruction"
      },
      "trigrams": {
        "upper": "010",
        "lower": "100"
      },
      "judgment": {
        "text": "Obstruction. The southwest furthers. The northeast does not further. It furthers one to see the great man. Perseverance brings good fortune.",
        "chinese": "蹇：利西南，不利東北。利見大人，貞吉。"
      },
      "image": {
        "text": "Water on the mountain. Thus the superior man turns his attention to himself and molds his character.",
        "chinese": "山上有水，蹇；君子以反身修德。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Going leads to obstructions, coming meets with praise."
        },
        {
          "position": 2,
          "text": "The king's servant is beset by obstruction upon obstruction, but it is not his own fault."
        },
        {
          "position": 3,
          "text": "Going leads to obstructions; hence he comes back."
        },
        {
          "position": 4,
          "text": "Going leads to obstructions, coming leads to union."
        },
        {
          "position": 5,
          "text": "In the midst of the greatest obstructions, friends come."
        },
        {
          "position": 6,
          "text": "Going leads to obstructions, coming leads to great good fortune. It furthers one to see the great man."
        }
      ]
    },
    {
      "number": 40,
      "binary": "001010",
      "name": {
        "chinese": "解",
        "pinyin": "xiè",
        "english": "Deliverance"
      },
      "trigrams": {
        "upper": "001",
        "lower": "010"
      },
      "judgment": {
        "text": "Deliverance. The southwest furthers. If there is no longer anything where one has to go, return brings good fortune. If there is still something where one has to go, hastening brings good fortune.",
        "chinese": "解：利西南，無所往，其來復吉。有攸往，夙吉。"
      },
      "image": {
        "text": "Thunder and rain set in. Thus the superior man pardons mistakes and forgives misdeeds.",
        "chinese": "雷雨作，解；君子以赦過宥罪。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Without blame."
        },
        {
          "position": 2,
          "text": "One kills three foxes in the field and receives a yellow arrow. Perseverance brings good fortune."
        },
        {
          "position": 3,
          "text": "If a man carries a burden on his back and nonetheless rides in a carriage, he thereby encourages robbers to draw near. Perseverance leads to humiliation."
        },
        {
          "position": 4,
          "text": "Deliver yourself from your great toe. Then the companion comes, and him you can trust."
        },
        {
          "position": 5,
          "text": "If only the superior man can deliver himself, it brings good fortune. Thus he proves to inferior men that he is in earnest."
        },
        {
          "position": 6,
          "text": "The prince shoots at a hawk on a high wall. He kills it. Everything serves to further."
        }
      ]
    },
    {
      "number": 41,
      "binary": "100011",
      "name": {
        "chinese": "損",
        "pinyin": "sǔn",
        "english": "Decrease"
      },
      "trigrams": {
        "upper": "100",
        "lower": "011"
      },
      "judgment": {
        "text": "Decrease combined with sincerity brings about supreme good fortune without blame. One may be persevering in this. It furthers one to undertake something. How is this to be carried out? One may use two small bowls for the sacrifice.",
        "chinese": "損：有孚，元吉，無咎，可貞，利有攸往。曷之用？二簋可用享。"
      },
      "image": {
        "text": "At the foot of the mountain, the lake. Thus the superior man controls his anger and restrains his instincts.",
        "chinese": "山下有澤，損；君子以懲忿窒慾。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Going quickly when one's tasks are finished is without blame. But one must reflect on how much one may decrease others."
        },
        {
          "position": 2,
          "text": "Perseverance furthers. To undertake something brings misfortune. Without decreasing oneself, one is able to bring increase to others."
        },
        {
          "position": 3,
          "text": "When three people journey together, their number decreases by one. When one man journeys alone, he finds a companion."
        },
        {
          "position": 4,
          "text": "If a man decreases his faults, it makes the other hasten to come and rejoice. No blame."
        },
        {
          "position": 5,
          "text": "Someone does indeed increase him. Ten pairs of tortoises cannot oppose it. Supreme good fortune."
        },
        {
          "position": 6,
          "text": "If one is increased without depriving others, there is no blame. Perseverance brings good fortune. It furthers one to undertake something."
        }
      ]
    },
    {
      "number": 42,
      "binary": "110001",
      "name": {
        "chinese": "益",
        "pinyin": "yì",
        "english": "Increase"
      },
      "trigrams": {
        "upper": "110",
        "lower": "001"
      },
      "judgment": {
        "text": "Increase. It furthers one to undertake something. It furthers one to cross the great water.",
        "chinese": "益：利有攸往，利涉大川。"
      },
      "image": {
        "text": "Wind and thunder: Increase. Thus the superior man: If he sees good, he imitates it; if he has faults, he rids himself of them.",
        "chinese": "風雷，益；君子以見善則遷，有過則改。"
      },
      "lines": [
        {
          "position": 1,
          "text": "It furthers one to accomplish great deeds. Supreme good fortune. No blame."
        },
        {
          "position": 2,
          "text": "Someone does indeed increase him; ten pairs of tortoises cannot oppose it. Constant perseverance brings good fortune. The king presents him before God. Good fortune."
        },
        {
          "position": 3,
          "text": "One is enriched through unfortunate events. No blame, if you are sincere and walk in the middle, and report with a seal to the prince."
        },
        {
          "position": 4,
          "text": "If you walk in the middle and report to the prince, he will follow. It furthers one to be used in the removal of the capital."
        },
        {
          "position": 5,
          "text": "If in truth you have a kind heart, ask not. Supreme good fortune. Truly, kindness will be recognized as your virtue."
        },
        {
          "position": 6,
          "text": "He brings increase to no one. Indeed, someone even strikes him. He does not keep his heart constantly steady. Misfortune."
        }
      ]
    },
    {
      "number": 43,
      "binary": "011111",
      "name": {
        "chinese": "夬",
        "pinyin": "guài",
        "english": "Breakthrough"
      },
      "trigrams": {
        "upper": "011",
        "lower": "111"
      },
      "judgment": {
        "text": "Breakthrough. One must resolutely make the matter known at the court of the king. It must be announced truthfully. Danger. It is necessary to notify one's own city. It does not further to resort to arms. It furthers one to undertake something.",
        "chinese": "夬：揚于王庭，孚號，有厲，告自邑，不利即戎，利有攸往。"
      },
      "image": {
        "text": "The lake has risen up to heaven. Thus the superior man dispenses riches downward and refrains from resting on his virtue.",
        "chinese": "澤上於天，夬；君子以施祿及下，居德則忌。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Mighty in the forward-striding toes. When one goes and is not equal to the task, one makes a mistake."
        },
        {
          "position": 2,
          "text": "A cry of alarm. Arms at evening and at night. Fear nothing."
        },
        {
          "position": 3,
          "text": "To be powerful in the cheekbones brings misfortune. The superior man is firmly resolved. He walks alone and is caught in the rain. He is bespattered, and people murmur against him. No blame."
        },
        {
          "position": 4,
          "text": "There is no skin on his thighs, and walking comes hard. If a man were to let himself be led like a sheep, remorse would disappear. But if these words are heard, they will not be believed."
        },
        {
          "position": 5,
          "text": "In dealing with weeds, firm resolution is necessary. Walking in the middle remains free of blame."
        },
        {
          "position": 6,
          "text": "No cry. In the end misfortune comes."
        }
      ]
    },
    {
      "number": 44,
      "binary": "111110",
      "name": {
        "chinese": "姤",
        "pinyin": "gòu",
        "english": "Coming to Meet"
      },
      "trigrams": {
        "upper": "111",
        "lower": "110"
      },
      "judgment": {
        "text": "Coming to Meet. The maiden is powerful. One should not marry such a maiden.",
        "chinese": "姤：女壯，勿用取女。"
      },
      "image": {
        "text": "Under heaven, wind. Thus does the prince act when disseminating his commands and proclaiming them to the four quarters of heaven.",
        "chinese": "天下有風，姤；后以施命誥四方。"
      },
      "lines": [
        {
          "position": 1,
          "text": "It must be checked with a brake of bronze. Perseverance brings good fortune. If one lets it take its course, one experiences misfortune."
        },
        {
          "position": 2,
          "text": "There is a fish in the tank. No blame. Does not further guests."
        },
        {
          "position": 3,
          "text": "There is no skin on his thighs, and walking comes hard. If one is mindful of the danger, no great mistake is made."
        },
        {
          "position": 4,
          "text": "No fish in the tank. This leads to misfortune."
        },
        {
          "position": 5,
          "text": "A melon covered with willow leaves. Hidden lines. Then it drops down to one from heaven."
        },
        {
          "position": 6,
          "text": "He comes to meet with his horns. Humiliation. No blame."
        }
      ]
    },
    {
      "number": 45,
      "binary": "011000",
      "name": {
        "chinese": "萃",
        "pinyin": "cuì",
        "english": "Gathering Together"
      },
      "trigrams": {
        "upper": "011",
        "lower": "000"
      },
      "judgment": {
        "text": "Gathering Together. Success. The king approaches his temple. It furthers one to see the great man. This brings success. Perseverance furthers. To bring great offerings creates good fortune. It furthers one to undertake something.",
        "chinese": "萃：亨。王假有廟，利見大人，亨，利貞。用大牲吉，利有攸往。"
      },
      "image": {
        "text": "Over the earth, the lake. Thus the superior man renews his weapons in order to meet the unforeseen.",
        "chinese": "澤上於地，萃；君子以除戎器，戒不虞。"
      },
      "lines": [
        {
          "position": 1,
          "text": "If you are sincere, but not to the end, there will sometimes be confusion, sometimes gathering together. If you call out, then after one grasp of the hand you can laugh again. Regret not. Going is without blame."
        },
        {
          "position": 2,
          "text": "Letting oneself be drawn brings good fortune and remains blameless. If one is sincere, it furthers one to bring even a small offering."
        },
        {
          "position": 3,
          "text": "Gathering together amid sighs. Nothing that would further. Going is without blame. Slight humiliation."
        },
        {
          "position": 4,
          "text": "Great good fortune. No blame."
        },
        {
          "position": 5,
          "text": "If in gathering together one has position, this brings no blame. If there are some who are not yet sincerely in the work, sublime and enduring perseverance is needed. Then remorse disappears."
        },
        {
          "position": 6,
          "text": "Lamenting and sighing, floods of tears. No blame."
        }
      ]
    },
    {
      "number": 46,
      "binary": "000110",
      "name": {
        "chinese": "升",
        "pinyin": "shēng",
        "english": "Pushing Upward"
      },
      "trigrams": {
        "upper": "000",
        "lower": "110"
      },
      "judgment": {
        "text": "Pushing Upward has supreme success. One must see the great man. Fear not. Departure toward the south brings good fortune.",
        "chinese": "升：元亨，用見大人，勿恤，南征吉。"
      },
      "image": {
        "text": "Within the earth, wood grows. Thus the superior man of devoted character heaps up small things in order to achieve something high and great.",
        "chinese": "地中生木，升；君子以順德，積小以高大。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Pushing upward that meets with confidence brings great good fortune."
        },
        {
          "position": 2,
          "text": "If one is sincere, it furthers one to bring even a small offering. No blame."
        },
        {
          "position": 3,
          "text": "One pushes upward into an empty city."
        },
        {
          "position": 4,
          "text": "The king offers him Mount Ch'i. Good fortune. No blame."
        },
        {
          "position": 5,
          "text": "Perseverance brings good fortune. One pushes upward by steps."
        },
        {
          "position": 6,
          "text": "Pushing upward in darkness. It furthers one to be unremittingly persevering."
        }
      ]
    },
    {
      "number": 47,
      "binary": "011010",
      "name": {
        "chinese": "困",
        "pinyin": "kùn",
        "english": "Oppression"
      },
      "trigrams": {
        "upper": "011",
        "lower": "010"
      },
      "judgment": {
        "text": "Oppression. Success. Perseverance. The great man brings about good fortune. No blame. When one has something to say, it is not believed.",
        "chinese": "困：亨，貞，大人吉，無咎，有言不信。"
      },
      "image": {
        "text": "There is no water in the lake. Thus the superior man stakes his life on following his will.",
        "chinese": "澤無水，困；君子以致命遂志。"
      },
      "lines": [
        {
          "position": 1,
          "text": "One sits oppressed under a bare tree and strays into a gloomy valley. For three years one sees nothing."
        },
        {
          "position": 2,
          "text": "One is oppressed while at meat and drink. The man with the scarlet knee bands is just coming. It furthers one to offer sacrifice. To set forth brings misfortune. No blame."
        },
        {
          "position": 3,
          "text": "One is oppressed by stone, and leans on thorns and thistles. He enters the house and does not see his wife. Misfortune."
        },
        {
          "position": 4,
          "text": "He comes very quietly, oppressed in a golden carriage. Humiliation, but the end is reached."
        },
        {
          "position": 5,
          "text": "His nose and feet are cut off. Oppression at the hands of the man with the purple knee bands. Joy comes softly. It furthers one to make offerings and libations."
        },
        {
          "position": 6,
          "text": "He is oppressed by creeping vines. He says to himself: Movement brings remorse. If one feels remorse over this and makes a start, good fortune comes."
        }
      ]
    },
    {
      "number": 48,
      "binary": "010110",
      "name": {
        "chinese": "井",
        "pinyin": "jǐng",
        "english": "The Well"
      },
      "trigrams": {
        "upper": "010",
        "lower": "110"
      },
      "judgment": {
        "text": "The Well. The town may be changed, but the well cannot be changed. It neither decreases nor increases. They come and go and draw from the well.",
        "chinese": "井：改邑不改井，無喪無得，往來井井。"
      },
      "image": {
        "text": "Water over wood: The Well. Thus the superior man encourages the people at their work, and exhorts them to help one another.",
        "chinese": "木上有水，井；君子以勞民勸相。"
      },
      "lines": [
        {
          "position": 1,
          "text": "One does not drink the mud of the well. No animals come to an old well."
        },
        {
          "position": 2,
          "text": "At the wellhole one shoots fishes. The jug is broken and leaks."
        },
        {
          "position": 3,
          "text": "The well is cleaned, but no one drinks from it. This is my heart's sorrow, for one might draw from it. If the king were clear-minded, good fortune might be enjoyed in common."
        },
        {
          "position": 4,
          "text": "The well is being lined. No blame."
        },
        {
          "position": 5,
          "text": "In the well there is a clear, cold spring from which one can drink."
        },
        {
          "position": 6,
          "text": "One draws from the well without hindrance. It is dependable. Supreme good fortune."
        }
      ]
    },
    {
      "number": 49,
      "binary": "011101",
      "name": {
        "chinese": "革",
        "pinyin": "gé",
        "english": "Revolution"
      },
      "trigrams": {
        "upper": "011",
        "lower": "101"
      },
      "judgment": {
        "text": "Revolution. On your own day you are believed. Supreme success, furthering through perseverance. Remorse disappears.",
        "chinese": "革：己日乃孚，元亨利貞，悔亡。"
      },
      "image": {
        "text": "Fire in the lake: Revolution. Thus the superior man sets the calendar in order and makes the seasons clear.",
        "chinese": "澤中有火，革；君子以治曆明時。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Wrapped in the hide of a yellow cow."
        },
        {
          "position": 2,
          "text": "When one's own day comes, one may create revolution. Starting brings good fortune. No blame."
        },
        {
          "position": 3,
          "text": "Starting brings misfortune. Perseverance brings danger. When talk of revolution has gone the rounds three times, one may commit himself, and men will believe him."
        },
        {
          "position": 4,
          "text": "Remorse disappears. Men believe him. Changing the form of government brings good fortune."
        },
        {
          "position": 5,
          "text": "The great man changes like a tiger. Even before questioning the oracle he is believed."
        },
        {
          "position": 6,
          "text": "The superior man changes like a panther. The inferior man molts in the face. Starting brings misfortune. To remain persevering brings good fortune."
        }
      ]
    },
    {
      "number": 50,
      "binary": "101110",
      "name": {
        "chinese": "鼎",
        "pinyin": "dǐng",
        "english": "The Caldron"
      },
      "trigrams": {
        "upper": "101",
        "lower": "110"
      },
      "judgment": {
        "text": "The Caldron. Supreme good fortune. Success.",
        "chinese": "鼎：元吉，亨。"
      },
      "image": {
        "text": "Fire over wood: The Caldron. Thus the superior man consolidates his fate by making his position correct.",
        "chinese": "木上有火，鼎；君子以正位凝命。"
      },
      "lines": [
        {
          "position": 1,
          "text": "A ting with legs upturned. It furthers to remove stagnating stuff. One takes a concubine for the sake of her son. No blame."
        },
        {
          "position": 2,
          "text": "There is food in the ting. My comrades are envious, but they cannot harm me. Good fortune."
        },
        {
          "position": 3,
          "text": "The handle of the ting is altered. One is impeded in his way of life. The fat of the pheasant is not eaten. Once rain falls, remorse is spent. Good fortune comes in the end."
        },
        {
          "position": 4,
          "text": "The legs of the ting are broken. The prince's meal is spilled and his person is soiled. Misfortune."
        },
        {
          "position": 5,
          "text": "The ting has yellow handles, golden carrying rings. Perseverance furthers."
        },
        {
          "position": 6,
          "text": "The ting has rings of jade. Great good fortune. Nothing that would not act to further."
        }
      ]
    },
    {
      "number": 51,
      "binary": "001001",
      "name": {
        "chinese": "震",
        "pinyin": "zhèn",
        "english": "The Arousing"
      },
      "trigrams": {
        "upper": "001",
        "lower": "001"
      },
      "judgment": {
        "text": "Shock brings success. Shock comes — Loss, loss! But things are not lost. After the shock comes renewed order.",
        "chinese": "震：亨。震來虩虩，笑言啞啞。震驚百里，不喪匕鬯。"
      },
      "image": {
        "text": "Thunder repeated: The Arousing. Thus in fear and trembling the superior man sets his life in order and examines himself.",
        "chinese": "洊雷，震；君子以恐懼修省。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Shock comes — Loss, loss! Then follow laughing words — Ha, ha! Good fortune."
        },
        {
          "position": 2,
          "text": "Shock comes bringing danger. A hundred thousand times you lose your treasures and climb the nine hills. Do not go in pursuit of them. After seven days you will get them back again."
        },
        {
          "position": 3,
          "text": "Shock comes and makes one distraught. If shock spurs to action, one remains free of misfortune."
        },
        {
          "position": 4,
          "text": "Shock is mired."
        },
        {
          "position": 5,
          "text": "Shock goes hither and thither. Danger. However, nothing at all is lost. Yet there are things to be done."
        },
        {
          "position": 6,
          "text": "Shock brings ruin and terrified gazing around. Going ahead brings misfortune. If it has not yet touched one's own body but has reached one's neighbor first, there is no blame."
        }
      ]
    },
    {
      "number": 52,
      "binary": "100100",
      "name": {
        "chinese": "艮",
        "pinyin": "gèn",
        "english": "Keeping Still"
      },
      "trigrams": {
        "upper": "100",
        "lower": "100"
      },
      "judgment": {
        "text": "Keeping Still. Keeping his back so still that he no longer feels his body. He goes into his courtyard and does not see his people. No blame.",
        "chinese": "艮：艮其背，不獲其身，行其庭不見其人，無咎。"
      },
      "image": {
        "text": "Mountains standing close together: Keeping Still. Thus the superior man does not permit his thoughts to go beyond his situation.",
        "chinese": "兼山，艮；君子以思不出其位。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Keeping his toes still. No blame. Continued perseverance furthers."
        },
        {
          "position": 2,
          "text": "Keeping his calves still. He cannot rescue him whom he follows. His heart is not glad."
        },
        {
          "position": 3,
          "text": "Keeping his hips still. Making his sacrum stiff. Dangerous. The heart suffocates."
        },
        {
          "position": 4,
          "text": "Keeping his trunk still. No blame."
        },
        {
          "position": 5,
          "text": "Keeping his jaws still. The words have order. Remorse disappears."
        },
        {
          "position": 6,
          "text": "Noble-hearted keeping still. Good fortune."
        }
      ]
    },
    {
      "number": 53,
      "binary": "110100",
      "name": {
        "chinese": "漸",
        "pinyin": "jiàn",
        "english": "Development"
      },
      "trigrams": {
        "upper": "110",
        "lower": "100"
      },
      "judgment": {
        "text": "Development. The maiden is given in marriage. Good fortune. Perseverance furthers.",
        "chinese": "漸：女歸吉，利貞。"
      },
      "image": {
        "text": "On the mountain, a tree. Thus the superior man abides in dignity and virtue, in order to improve the mores.",
        "chinese": "山上有木，漸；君子以居賢德善俗。"
      },
      "lines": [
        {
          "position": 1,
          "text": "The wild goose gradually draws near the shore. The young son is in danger. There is talk. No blame."
        },
        {
          "position": 2,
          "text": "The wild goose gradually draws near the cliff. Eating and drinking in peace and concord. Good fortune."
        },
        {
          "position": 3,
          "text": "The wild goose gradually draws near the plateau. The man goes forth and does not return. The woman carries a child but does not bring it forth. Misfortune."
        },
        {
          "position": 4,
          "text": "The wild goose gradually draws near the tree. Perhaps it will find a flat branch. No blame."
        },
        {
          "position": 5,
          "text": "The wild goose gradually draws near the summit. For three years the woman has no child. In the end nothing can hinder her. Good fortune."
        },
        {
          "position": 6,
          "text": "The wild goose gradually draws near the cloud heights. Its feathers can be used for the sacred dance. Good fortune."
        }
      ]
    },
    {
      "number": 54,
      "binary": "001011",
      "name": {
        "chinese": "歸妹",
        "pinyin": "guī mèi",
        "english": "The Marrying Maiden"
      },
      "trigrams": {
        "upper": "001",
        "lower": "011"
      },
      "judgment": {
        "text": "The Marrying Maiden. Undertakings bring misfortune. Nothing that would further.",
        "chinese": "歸妹：征凶，無攸利。"
      },
      "image": {
        "text": "Thunder over the lake: The Marrying Maiden. Thus the superior man understands the transitory in the light of the eternity of the end.",
        "chinese": "澤上有雷，歸妹；君子以永終知敝。"
      },
      "lines": [
        {
          "position": 1,
          "text": "The marrying maiden as a concubine. A lame man who is able to tread. Undertakings bring good fortune."
        },
        {
          "position": 2,
          "text": "A one-eyed man who is able to see. The perseverance of a solitary man furthers."
        },
        {
          "position": 3,
          "text": "The marrying maiden as a slave. She marries as a concubine."
        },
        {
          "position": 4,
          "text": "The marrying maiden draws out the allotted time. A late marriage comes in due course."
        },
        {
          "position": 5,
          "text": "The sovereign I gave his daughter in marriage. The embroidered garments of the princess were not as gorgeous as those of the servingmaid. The moon that is nearly full brings good fortune."
        },
        {
          "position": 6,
          "text": "The woman holds the basket, but there are no fruits in it. The man stabs the sheep, but no blood flows. Nothing that acts to further."
        }
      ]
    },
    {
      "number": 55,
      "binary": "001101",
      "name": {
        "chinese": "豐",
        "pinyin": "fēng",
        "english": "Abundance"
      },
      "trigrams": {
        "upper": "001",
        "lower": "101"
      },
      "judgment": {
        "text": "Abundance has success. The king attains abundance. Be not sad. Be like the sun at midday.",
        "chinese": "豐：亨，王假之，勿憂，宜日中。"
      },
      "image": {
        "text": "Both thunder and lightning come: Abundance. Thus the superior man decides lawsuits and carries out punishments.",
        "chinese": "雷電皆至，豐；君子以折獄致刑。"
      },
      "lines": [
        {
          "position": 1,
          "text": "When a man meets his destined ruler, they can be together ten days, and it is not a mistake. Going meets with recognition."
        },
        {
          "position": 2,
          "text": "The curtain is of such fullness that the polestars can be seen at noon. Through going one meets with mistrust and hate. If one rouses him through truth, good fortune comes."
        },
        {
          "position": 3,
          "text": "The underbrush is of such abundance that the small stars can be seen at noon. He breaks his right arm. No blame."
        },
        {
          "position": 4,
          "text": "The curtain is of such fullness that the polestars can be seen at noon. He meets his ruler, who is of like kind. Good fortune."
        },
        {
          "position": 5,
          "text": "Lines are coming. Blessing and fame draw near. Good fortune."
        },
        {
          "position": 6,
          "text": "His house is in a state of abundance. He screens off his family. He peers through the gate and no longer perceives anyone. For three years he sees nothing. Misfortune."
        }
      ]
    },
    {
      "number": 56,
      "binary": "101100",
      "name": {
        "chinese": "旅",
        "pinyin": "lǚ",
        "english": "The Wanderer"
      },
      "trigrams": {
        "upper": "101",
        "lower": "100"
      },
      "judgment": {
        "text": "The Wanderer. Success through smallness. Perseverance brings good fortune to the wanderer.",
        "chinese": "旅：小亨，旅貞吉。"
      },
      "image": {
        "text": "Fire on the mountain: The Wanderer. Thus the superior man is clear-minded and cautious in imposing penalties, and protracts no lawsuits.",
        "chinese": "山上有火，旅；君子以明慎用刑而不留獄。"
      },
      "lines": [
        {
          "position": 1,
          "text": "If the wanderer busies himself with trivial things, he draws down misfortune upon himself."
        },
        {
          "position": 2,
          "text": "The wanderer comes to an inn. He has his property with him. He wins the steadfastness of a young servant."
        },
        {
          "position": 3,
          "text": "The wanderer's inn burns down. He loses the steadfastness of his young servant. Danger."
        },
        {
          "position": 4,
          "text": "The wanderer rests in a shelter. He obtains his property and an axe. My heart is not glad."
        },
        {
          "position": 5,
          "text": "He shoots a pheasant. It drops with the first arrow. In the end this brings both praise and office."
        },
        {
          "position": 6,
          "text": "The bird's nest burns up. The wanderer laughs first, then must needs lament and weep. Through carelessness he loses his cow. Misfortune."
        }
      ]
    },
    {
      "number": 57,
      "binary": "110110",
      "name": {
        "chinese": "巽",
        "pinyin": "xùn",
        "english": "The Gentle"
      },
      "trigrams": {
        "upper": "110",
        "lower": "110"
      },
      "judgment": {
        "text": "The Gentle. Success through what is small. It furthers one to have somewhere to go. It furthers one to see the great man.",
        "chinese": "巽：小亨，利有攸往，利見大人。"
      },
      "image": {
        "text": "Winds following one upon the other: The Gentle. Thus the superior man spreads his commands abroad and carries out his undertakings.",
        "chinese": "隨風，巽；君子以申命行事。"
      },
      "lines": [
        {
          "position": 1,
          "text": "In advancing and in retreating, the perseverance of a warrior furthers."
        },
        {
          "position": 2,
          "text": "Penetration under the bed. Priests and magicians are used in great number. Good fortune. No blame."
        },
        {
          "position": 3,
          "text": "Repeated penetration. Humiliation."
        },
        {
          "position": 4,
          "text": "Remorse vanishes. During the hunt three kinds of game are caught."
        },
        {
          "position": 5,
          "text": "Perseverance brings good fortune. Remorse vanishes. Nothing that does not further. No beginning, but an end. Before the change, three days. After the change, three days. Good fortune."
        },
        {
          "position": 6,
          "text": "Penetration under the bed. He loses his property and his axe. Perseverance brings misfortune."
        }
      ]
    },
    {
      "number": 58,
      "binary": "011011",
      "name": {
        "chinese": "兌",
        "pinyin": "duì",
        "english": "The Joyous"
      },
      "trigrams": {
        "upper": "011",
        "lower": "011"
      },
      "judgment": {
        "text": "The Joyous. Success. Perseverance is favorable.",
        "chinese": "兌：亨，利貞。"
      },
      "image": {
        "text": "Lakes resting one on the other: The Joyous. Thus the superior man joins with his friends for discussion and practice.",
        "chinese": "麗澤，兌；君子以朋友講習。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Contented joyousness. Good fortune."
        },
        {
          "position": 2,
          "text": "Sincere joyousness. Good fortune. Remorse disappears."
        },
        {
          "position": 3,
          "text": "Coming joyousness. Misfortune."
        },
        {
          "position": 4,
          "text": "Joyousness that is weighed is not at peace. After ridding himself of mistakes a man has joy."
        },
        {
          "position": 5,
          "text": "Sincerity toward disintegrating influences is dangerous."
        },
        {
          "position": 6,
          "text": "Seductive joyousness."
        }
      ]
    },
    {
      "number": 59,
      "binary": "110010",
      "name": {
        "chinese": "渙",
        "pinyin": "huàn",
        "english": "Dispersion"
      },
      "trigrams": {
        "upper": "110",
        "lower": "010"
      },
      "judgment": {
        "text": "Dispersion. Success. The king approaches his temple. It furthers one to cross the great water. Perseverance furthers.",
        "chinese": "渙：亨。王假有廟，利涉大川，利貞。"
      },
      "image": {
        "text": "The wind drives over the water: Dispersion. Thus the kings of old sacrificed to the Lord and built temples.",
        "chinese": "風行水上，渙；先王以享于帝立廟。"
      },
      "lines": [
        {
          "position": 1,
          "text": "He brings help with the strength of a horse. Good fortune."
        },
        {
          "position": 2,
          "text": "At the dissolution he hurries to that which supports him. Remorse disappears."
        },
        {
          "position": 3,
          "text": "He dissolves his self. No remorse."
        },
        {
          "position": 4,
          "text": "He dissolves his bond with his group. Supreme good fortune. Dispersion leads in turn to accumulation. This is something that ordinary men do not think of."
        },
        {
          "position": 5,
          "text": "His loud cries are as dissolving as sweat. Dissolution. A king abides without blame."
        },
        {
          "position": 6,
          "text": "He dissolves his blood. Departing, keeping at a distance, going out, is without blame."
        }
      ]
    },
    {
      "number": 60,
      "binary": "010011",
      "name": {
        "chinese": "節",
        "pinyin": "jié",
        "english": "Limitation"
      },
      "trigrams": {
        "upper": "010",
        "lower": "011"
      },
      "judgment": {
        "text": "Limitation. Success. Galling limitation must not be persevered in.",
        "chinese": "節：亨。苦節不可貞。"
      },
      "image": {
        "text": "Water over lake: Limitation. Thus the superior man creates number and measure, and examines the nature of virtue and correct conduct.",
        "chinese": "澤上有水，節；君子以制數度，議德行。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Not going out of the door and the courtyard is without blame."
        },
        {
          "position": 2,
          "text": "Not going out of the gate and the courtyard brings misfortune."
        },
        {
          "position": 3,
          "text": "He who knows no limitation will have cause to lament. No blame."
        },
        {
          "position": 4,
          "text": "Contented limitation. Success."
        },
        {
          "position": 5,
          "text": "Sweet limitation brings good fortune. Going brings esteem."
        },
        {
          "position": 6,
          "text": "Galling limitation. Perseverance brings misfortune. Remorse disappears."
        }
      ]
    },
    {
      "number": 61,
      "binary": "110011",
      "name": {
        "chinese": "中孚",
        "pinyin": "zhōng fú",
        "english": "Inner Truth"
      },
      "trigrams": {
        "upper": "110",
        "lower": "011"
      },
      "judgment": {
        "text": "Inner Truth. Pigs and fishes. Good fortune. It furthers one to cross the great water. Perseverance furthers.",
        "chinese": "中孚：豚魚吉，利涉大川，利貞。"
      },
      "image": {
        "text": "Wind over lake: Inner Truth. Thus the superior man discusses criminal cases in order to delay executions.",
        "chinese": "澤上有風，中孚；君子以議獄緩死。"
      },
      "lines": [
        {
          "position": 1,
          "text": "Being prepared brings good fortune. If there are secret designs, it is disquieting."
        },
        {
          "position": 2,
          "text": "A crane calling in the shade. Its young answers it. I have a good goblet. I will share it with you."
        },
        {
          "position": 3,
          "text": "He finds a comrade. Now he beats the drum, now he stops. Now he sobs, now he sings."
        },
        {
          "position": 4,
          "text": "The moon nearly at the full. The team horse goes astray. No blame."
        },
        {
          "position": 5,
          "text": "He possesses truth, which links together. No blame."
        },
        {
          "position": 6,
          "text": "Cockcrow penetrating to heaven. Perseverance brings misfortune."
        }
      ]
    },
    {
      "number": 62,
      "binary": "001100",
      "name": {
        "chinese": "小過",
        "pinyin": "xiǎo guò",
        "english": "Preponderance of the Small"
      },
      "trigrams": {
        "upper": "001",
        "lower": "100"
      },
      "judgment": {
        "text": "Preponderance of the Small. Success. Perseverance furthers. Small things may be done; great things should not be done. The flying bird brings the message: It is not well to strive upward, it is well to remain below. Great good fortune.",
        "chinese": "小過：亨，利貞，可小事，不可大事。飛鳥遺之音，不宜上宜下，大吉。"
      },
      "image": {
        "text": "Thunder on the mountain: Preponderance of the Small. Thus in his conduct the superior man gives preponderance to reverence. In bereavement he gives preponderance to grief. In his expenditures he gives preponderance to thrift.",
        "chinese": "山上有雷，小過；君子以行過乎恭，喪過乎哀，用過乎儉。"
      },
      "lines": [
        {
          "position": 1,
          "text": "The bird meets with misfortune through flying."
        },
        {
          "position": 2,
          "text": "She passes by her ancestor and meets her ancestress. He does not reach his prince and meets the official. No blame."
        },
        {
          "position": 3,
          "text": "If one is not extremely careful, somebody may come up from behind and strike him. Misfortune."
        },
        {
          "position": 4,
          "text": "No blame. He meets him without passing by. Going brings danger. One must be on guard. Do not act. Be constantly persevering."
        },
        {
          "position": 5,
          "text": "Dense clouds, no rain from our western territory. The prince shoots and hits him who is in the cave."
        },
        {
          "position": 6,
          "text": "He passes him by, not meeting him. The flying bird leaves him. Misfortune. This means bad luck and injury."
        }
      ]
    },
    {
      "number": 63,
      "binary": "010101",
      "name": {
        "chinese": "既濟",
        "pinyin": "jì jì",
        "english": "After Completion"
      },
      "trigrams": {
        "upper": "010",
        "lower": "101"
      },
      "judgment": {
        "text": "After Completion. Success in small matters. Perseverance furthers. At the beginning good fortune, at the end disorder.",
        "chinese": "既濟：亨，小利貞，初吉終亂。"
      },
      "image": {
        "text": "Water over fire: After Completion. Thus the superior man takes thought of misfortune and arms himself against it in advance.",
        "chinese": "水在火上，既濟；君子以思患而豫防之。"
      },
      "lines": [
        {
          "position": 1,
          "text": "He brakes his wheels. He gets his tail in the water. No blame."
        },
        {
          "position": 2,
          "text": "The woman loses the curtain of her carriage. Do not run after it; on the seventh day you will get it."
        },
        {
          "position": 3,
          "text": "The Illustrious Ancestor disciplines the Devil's Country. After three years he conquers it. Inferior people must not be employed."
        },
        {
          "position": 4,
          "text": "The finest clothes turn to rags. Be careful all day long."
        },
        {
          "position": 5,
          "text": "The neighbor in the east who slaughters an ox does not attain as much real happiness as the neighbor in the west with his small offering."
        },
        {
          "position": 6,
          "text": "He gets his head in the water. Danger."
        }
      ]
    },
    {
      "number": 64,
      "binary": "101010",
      "name": {
        "chinese": "未濟",
        "pinyin": "wèi jì",
        "english": "Before Completion"
      },
      "trigrams": {
        "upper": "101",
        "lower": "010"
      },
      "judgment": {
        "text": "Before Completion. Success. But if the little fox, after nearly completing the crossing, gets his tail in the water, there is nothing that would further.",
        "chinese": "未濟：亨，小狐汔濟，濡其尾，無攸利。"
      },
      "image": {
        "text": "Fire over water: Before Completion. Thus the superior man is careful in the differentiation of things, so that each finds its place.",
        "chinese": "火在水上，未濟；君子以慎辨物居方。"
      },
      "lines": [
        {
          "position": 1,
          "text": "He gets his tail in the water. Humiliating."
        },
        {
          "position": 2,
          "text": "He brakes his wheels. Perseverance brings good fortune."
        },
        {
          "position": 3,
          "text": "Before completion, attack brings misfortune. It furthers one to cross the great water."
        },
        {
          "position": 4,
          "text": "Perseverance brings good fortune. Remorse disappears. Shock, thus to discipline the Devil's Country. For three years, great realms are awarded."
        },
        {
          "position": 5,
          "text": "Perseverance brings good fortune. No remorse. The light of the superior man is true. Good fortune."
        },
        {
          "position": 6,
          "text": "Drinking wine in genuine confidence. No blame. But if one wets his head, he loses it, in truth."
        }
      ]
    }
  ]
}